Revit 2024 API
CurveLoop.HasPlane Method
 Identifies if the CurveLoop is planar.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public bool HasPlane()
Visual Basic
Public Function HasPlane As Boolean
Visual C++
public:
bool HasPlane()
Return Value
 True if the curve loop is planar, false otherwise.
See Also
CurveLoop Class
Autodesk.Revit.DB Namespace